11/data/attachments/dc408e5498717b48.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>David_note_Friend_3789_4</nif:username>
            <nif:friendToBeRequested>soap_friends_04f8f895-f6fc-4df2-b9a3-58cd98de6d1c</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>